# BIMExportOptions Class

---
The base class for options used to export using ATF.
SystemObject Autodesk.Revit.DBBIMExportOptions Autodesk.Revit.DBOBJExportOptions Autodesk.Revit.DBSTEPExportOptions Autodesk.Revit.DBSTLExportOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class BIMExportOptions : IDisposable

    Public Class BIMExportOptions
    	Implements IDisposable

    public ref class BIMExportOptions : IDisposable

    type BIMExportOptions =
        class
            interface IDisposable
        end
The BIMExportOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| ViewId|  The element id of the 3D view to export. InvalidElementId by default.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the BIMExportOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace